#ifndef UI_H
#define UI_H
#include <iostream>
using namespace std;
class ui {
 public:
  void display() {
    cout << "+--------------------------------------------------------+"
         << endl;
    cout << "|                请输入数字选择身份                         "
         << endl;
    cout << "|                1.住户                                   "
         << endl;
    cout << "|                2.管理员                                 "
         << endl;
    cout << "+--------------------------------------------------------+"
         << endl;
    cout << "请输入数字：" << endl;
  }
  void userUI() {
    cout << "+--------------------------------------------------------+"
         << endl;
    cout << "|              1.请输入ID登入系统                              "
         << endl;
    cout << "|              2.自行录入信息                              "
         << endl;
    cout << "+--------------------------------------------------------+"
         << endl;
    cout << "请输入数字：" << endl;
  }
  void userUI1() {
    cout << "+--------------------------------------------------------+"
         << endl;
    cout << "|              请输入ID登入系统                              "
         << endl;
    cout << "+--------------------------------------------------------+"
         << endl;
    cout << "请输入ID：" << endl;
  }
  void successUserUi() {
     cout << "+--------------------------------------------------------+"
         << endl;
     cout << "|              请输入数字选择功能                             "
         << endl;
     cout << "|             1.查询自己是否处于隔离状态                       "
         << endl;
     cout << "+--------------------------------------------------------+"
         << endl; 
     cout << "请输入数字：" << endl;  
  }
};
#endif