#ifndef UI_H
#define UI_H
#include <iostream>
using namespace std;
class ui {
 public:
  void display() {
    cout << "+--------------------------------------------------------+"
         << endl;
    cout << "|                请输入数字选择身份                         "
         << endl;
    cout << "|                1.住户                                   "
         << endl;
    cout << "|                2.管理员                                 "
         << endl;
    cout << "+--------------------------------------------------------+"
         << endl;
    cout << "请输入数字：" << endl;
  }
  void userUI() {
    cout << "+--------------------------------------------------------+"
         << endl;
    cout << "|              1.请输入ID登入系统                              "
         << endl;
    cout << "|              2.自行录入信息                              "
         << endl;
    cout << "+--------------------------------------------------------+"
         << endl;
    cout << "请输入数字：" << endl;
  }
  void userUI1() {
    cout << "+--------------------------------------------------------+"
         << endl;
    cout << "|              请输入ID登入系统                              "
         << endl;
    cout << "+--------------------------------------------------------+"
         << endl;
    cout << "请输入ID：" << endl;
  }
  void userUI2() {
    cout << "+--------------------------------------------------------+"
         << endl;
    cout << "|              请输入个人基本信息                              "
         << endl;
    cout << "+--------------------------------------------------------+"
         << endl;
  }
  void successUserUi() {
    cout << "+--------------------------------------------------------+"
         << endl;
    cout << "|              请输入数字选择功能                             "
         << endl;
    cout << "|             1.查询自己是否处于隔离状态                       "
         << endl;
    cout << "+--------------------------------------------------------+"
         << endl;
    cout << "请输入数字：" << endl;
  }
  void adminUI() {
    cout << "+--------------------------------------------------------+"
         << endl;
    cout << "|              1.查询自己是否处于隔离状态                      "
         << endl;
    cout << "|              2.通过住户id查询是否处于隔离状态                 "
         << endl;
    cout << "|              3.查询所有住户信息                            "
         << endl;
    cout << "|              4.查询所有正在隔离的住户信息                    "
         << endl;
    cout << "|              5.添加住户                                   "
         << endl;
    cout << "|              6.删除住户                                   "
         << endl;
    cout << "|              7.通过住户id编辑个人信息                      "
         << endl;
    cout << "|              8.通过住户id编辑个人状态                        "
         << endl;
    cout << "+--------------------------------------------------------+"
         << endl;
    cout << "请输入数字：" << endl;
  }
};
#endif