#ifndef UI_H
#define UI_H
#include <cstdlib>
#include <iostream>
void clear() { system("cls"); }
using namespace std;
class ui {
 public:
  void display() {
    cout << "+-------------------------------------------------+" << endl;
    cout << "|                媒体库管理系统                      " << endl;
    cout << "+-------------------------------------------------+" << endl;
    cout << "|                1.添加物品                         " << endl;
    cout << "+-------------------------------------------------+" << endl;
    cout << "|                2.查询物品                         " << endl;
    cout << "+-------------------------------------------------+" << endl;
    cout << "|                3.显示当前库中所有物品               " << endl;
    cout << "+-------------------------------------------------+" << endl;
    cout << "|                4.编辑物品                         " << endl;
    cout << "+-------------------------------------------------+" << endl;
    cout << "|                5.删除物品                         " << endl;
    cout << "+-------------------------------------------------+" << endl;
    cout << "|                6.统计当前库中所有物品               " << endl;
    cout << "+-------------------------------------------------+" << endl;
    cout << "|温馨提示：系统中操作为单向操作，错误操作请重开程序     " << endl;
    cout << "+-------------------------------------------------+" << endl;
    cout << "请输入数字选择功能并按回车确认:";
  }
  void addUI() {
    clear();
    cout << "+-------------------------------------------------+" << endl;
    cout << "|                1.添加图书                         " << endl;
    cout << "+-------------------------------------------------+" << endl;
    cout << "|                2.添加视频光盘                      " << endl;
    cout << "+-------------------------------------------------+" << endl;
    cout << "|                3.添加图画                         " << endl;
    cout << "+-------------------------------------------------+" << endl;
    cout << "请输入数字选择添加物品种类并按回车确认:";
  }
  void addBook() {
    clear();
    cout << "+-------------------------------------------------+" << endl;
    cout << "|                添加图书                         " << endl;
    cout << "+-------------------------------------------------+" << endl;
    cout << "请依次输入：编号，标题，作者，评级，出版社，ISBN码，页数（每输入完"
            "一项请敲回车换行）:"
         << endl;
  }
  void addCD() {
    clear();
    cout << "+-------------------------------------------------+" << endl;
    cout << "|                添加视频光盘                         " << endl;
    cout << "+-------------------------------------------------+" << endl;
    cout << "请依次输入：编号，标题，作者，评级，出版人，出版年，视频时长（每输"
            "入完"
            "一项请敲回车换行）:"
         << endl;
  }
  void addPicture() {
    clear();
    cout << "+-------------------------------------------------+" << endl;
    cout << "|                添加图画                           " << endl;
    cout << "+-------------------------------------------------+" << endl;
    cout << "请依次输入：编号，标题，作者，评级，出版国家，长，宽（每输入完"
            "一项请敲回车换行）:"
         << endl;
  }
  void searchUI() {
    clear();
    cout << "+-------------------------------------------------+" << endl;
    cout << "|                1.按标题查询                         " << endl;
    cout << "+-------------------------------------------------+" << endl;
    cout << "|                2.按编号查询                      " << endl;
    cout << "+-------------------------------------------------+" << endl;
    cout << "|                3.按类别查询                         " << endl;
    cout << "+-------------------------------------------------+" << endl;
    cout << "请输入数字选择查询方式并按回车确认:";
  }
  void searchTitle() {
    clear();
    cout << "+-------------------------------------------------+" << endl;
    cout << "|                按标题查询                           " << endl;
    cout << "+-------------------------------------------------+" << endl;
    cout << "请输入标题并按回车确认:" << endl;
  }
  void searchID() {
    clear();
    cout << "+-------------------------------------------------+" << endl;
    cout << "|                按编号查询                           " << endl;
    cout << "+-------------------------------------------------+" << endl;
    cout << "请输入编号并按回车确认:" << endl;
  }
  void searchClass() {
    clear();
    cout << "+-------------------------------------------------+" << endl;
    cout << "|                按类别查询                           " << endl;
    cout << "+-------------------------------------------------+" << endl;
    cout << "请输入类别(图书，视频光盘，图画)并按回车确认:" << endl;
  }
  void allUI() {
    clear();
    cout << "+-------------------------------------------------+" << endl;
    cout << "|                当前库中物品                         " << endl;
    cout << "+-------------------------------------------------+" << endl;
  }
  void editUI() {
    clear();
    cout << "+-------------------------------------------------+" << endl;
    cout << "|                1.编辑图书                         " << endl;
    cout << "+-------------------------------------------------+" << endl;
    cout << "|                2.编辑视频光盘                      " << endl;
    cout << "+-------------------------------------------------+" << endl;
    cout << "|                3.编辑图画                         " << endl;
    cout << "+-------------------------------------------------+" << endl;
    cout << "请输入数字选择编辑物品并按回车确认:";
  }
  void editBook() {
    clear();
    cout << "+-------------------------------------------------+" << endl;
    cout << "|                编辑图书                         " << endl;
    cout << "+-------------------------------------------------+" << endl;
    cout << "请输入需编辑图书的编号" << endl;
  }
  void editCD() {
    clear();
    cout << "+-------------------------------------------------+" << endl;
    cout << "|                编辑视频光盘                         " << endl;
    cout << "+-------------------------------------------------+" << endl;
    cout << "请输入需编辑光盘的编号" << endl;
  }
  void editPicture() {
    clear();
    cout << "+-------------------------------------------------+" << endl;
    cout << "|                编辑图画                         " << endl;
    cout << "+-------------------------------------------------+" << endl;
    cout << "请输入需编辑图画的编号" << endl;
  }
  void deleteUI() {
    clear();
    cout << "+-------------------------------------------------+" << endl;
    cout << "|                1.删除图书                         " << endl;
    cout << "+-------------------------------------------------+" << endl;
    cout << "|                2.删除视频光盘                      " << endl;
    cout << "+-------------------------------------------------+" << endl;
    cout << "|                3.删除图画                         " << endl;
    cout << "+-------------------------------------------------+" << endl;
    cout << "请输入数字选择删除物品种类并按回车确认:";
  }
  void deleteBook() {
    clear();
    cout << "+-------------------------------------------------+" << endl;
    cout << "|                删除图书                         " << endl;
    cout << "+-------------------------------------------------+" << endl;
    cout << "请输入需删除图画的编号" << endl;
  }
  void deleteCD() {
    clear();
    cout << "+-------------------------------------------------+" << endl;
    cout << "|                删除视频光盘                         " << endl;
    cout << "+-------------------------------------------------+" << endl;
    cout << "请输入需删除视频光盘的编号" << endl;
  }
  void deletePicture() {
    clear();
    cout << "+-------------------------------------------------+" << endl;
    cout << "|                删除图画                         " << endl;
    cout << "+-------------------------------------------------+" << endl;
    cout << "请输入需删除图画的编号" << endl;
  }
  void getTotalUI() {
    clear();
    cout << "+-------------------------------------------------+" << endl;
    cout << "|                库中总体信息                         " << endl;
    cout << "+-------------------------------------------------+" << endl;
  }
};
#endif